In [1]:
# 인덱스 = 행이름
# 인덱스 != 행번호
# 인덱스를 별도로 지정하지 않으면, 0부터 시작하는 정수

## 인덱스로 행 추출하기
# 데이터프레임.loc[인덱스]  --> 시리즈 형태로 추출
# 데이터프레임.loc[인덱스리스트]  --> 데이터프레임형태로 추출

In [2]:
import pandas as pd
df = pd.read_csv('data/scores.csv')
df.index = 'i'+ df.index.astype('str')
df.head()

       name    kor    eng   math
i0    Aiden  100.0   90.0   95.0
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0
i4    Henry    NaN   35.0   60.0

# 인덱스로 행 데이터 추출하기
- 데이터프레임명.loc[인덱스]
: 시리즈 형태로 추출한다. 하나의 인덱스만 사용가능
- 데이터프레임명.loc[인덱스리스트]
: 데이터프레임 형태로 추출한다. 한개 이상의 인덱스를 사용할 수 있다

## 시리즈 형태로 추출하기

In [8]:
# 인덱스가 i3인 행 추출하여 s1에 담기
s1 = df.loc['i3']
s1  # --> 시리즈 형태.

name     Evan
kor     100.0
eng     100.0
math    100.0
Name: i3, dtype: object

In [9]:
# s1 type
type(s1)

pandas.core.series.Series

In [11]:
# s1 index
s1.index

Index(['name', 'kor', 'eng', 'math'], dtype='object')

In [13]:
# s1 value
s1.values

array(['Evan', 100.0, 100.0, 100.0], dtype=object)

## 데이터프레임 형태로 추출하기

In [16]:
# 인덱스가 i1,i3,i5인 행 추출하기
s2 = df.loc[['i1','i3','i5']]
s2

       name    kor    eng   math
i1  Charles   90.0   80.0   75.0
i3     Evan  100.0  100.0  100.0
i5      Ian   90.0  100.0   90.0

In [18]:
# 인덱스가 i3인 행을 데이터프레임 형태로 추출하기
s3 = df.loc[['i3']]
s3

    name    kor    eng   math
i3  Evan  100.0  100.0  100.0

In [19]:
# 인덱스에 없는 값을 사용하면 error
s4 = df.loc[-1]
s4

KeyError: -1

# 인덱스로 행,열 추출하기

## 인덱스, 컬럼에 해당하는 한개의 데이터 뽑아오기
- 데이터프레임명.loc[인덱스,컬럼명]

In [23]:
# 인덱스 i1의 kor 점수
df.loc['i1','kor']

90.0

In [24]:
# type
type(df.loc['i1','kor'])

numpy.float64

## 특정 인덱스의 여러 컬럼 데이터 추출하기
- 데이터프레임명.loc[인덱스,컬럼명리스트]

In [25]:
# 인덱스 i1 name, kor
df.loc['i1',['name','kor']]

name    Charles
kor        90.0
Name: i1, dtype: object

In [26]:
# type
type(df.loc['i1',['name','kor']])

pandas.core.series.Series

## 여러 인덱스의 특정 컬럼 데이터 추출하기
- 데이터프레임명.loc[인덱스리스트,컬럼명]

In [27]:
# 인덱스 i1,i3,i5의 name
df.loc[['i1','i3','i5'],'name']

i1    Charles
i3       Evan
i5        Ian
Name: name, dtype: object

In [28]:
# type
type(df.loc[['i1','i3','i5'],'name'])

pandas.core.series.Series

## 여러 인덱스의 여러 컬럼 가져오기
- 데이터프레임명.loc[인덱스리스트,컬럼리스트]

In [29]:
# 인덱스 i1,i3,i5의 name,kor
df.loc[['i1','i3','i5'],['name','kor']]

       name    kor
i1  Charles   90.0
i3     Evan  100.0
i5      Ian   90.0

In [30]:
type(df.loc[['i1','i3','i5'],['name','kor']])

pandas.core.frame.DataFrame

## 모든 행에서 특정 열 가져오기
- 데이터프레임.loc[:,컬럼명]
- 데이터프레임.loc[:,컬럼리스트]

In [32]:
# 모든 행에서 'name' 가져오기
df.loc[:,'name']

i0        Aiden
i1      Charles
i2       Danial
i3         Evan
i4        Henry
i5          Ian
i6        James
i7       Julian
i8       Justin
i9        Kevin
i10         Leo
i11      Oliver
i12       Peter
i13         Amy
i14       Chloe
i15       Danna
i16       Ellen
i17        Emma
i18    Jennifer
i19        Kate
i20       Linda
i21      Olivia
i22        Rose
i23       Sofia
i24     Tiffany
i25     Vanessa
i26     Viviana
i27      Vikkie
i28      Winnie
i29        Zuly
Name: name, dtype: object

In [33]:
# 모든 행에서 name, math 가져오기
df.loc[:,['name','math']]

         name   math
i0      Aiden   95.0
i1    Charles   75.0
i2     Danial  100.0
i3       Evan  100.0
i4      Henry   60.0
i5        Ian   90.0
i6      James   65.0
i7     Julian   55.0
i8     Justin  100.0
i9      Kevin   90.0
i10       Leo   70.0
i11    Oliver   65.0
i12     Peter  100.0
i13       Amy   90.0
i14     Chloe   95.0
i15     Danna  100.0
i16     Ellen    NaN
i17      Emma   70.0
i18  Jennifer   80.0
i19      Kate   50.0
i20     Linda  100.0
i21    Olivia   90.0
i22      Rose   70.0
i23     Sofia  100.0
i24   Tiffany   90.0
i25   Vanessa   95.0
i26   Viviana  100.0
i27    Vikkie  100.0
i28    Winnie   70.0
i29      Zuly   95.0

In [34]:
# 모든 행에서 name 가져오기 (데이터프레임)
df.loc[:,['name']]

         name
i0      Aiden
i1    Charles
i2     Danial
i3       Evan
i4      Henry
i5        Ian
i6      James
i7     Julian
i8     Justin
i9      Kevin
i10       Leo
i11    Oliver
i12     Peter
i13       Amy
i14     Chloe
i15     Danna
i16     Ellen
i17      Emma
i18  Jennifer
i19      Kate
i20     Linda
i21    Olivia
i22      Rose
i23     Sofia
i24   Tiffany
i25   Vanessa
i26   Viviana
i27    Vikkie
i28    Winnie
i29      Zuly

In [35]:
##

In [38]:
# 행번호 = 행 위치
# 열번호 = 열 위치
# 인덱스 = 행 이름
# 컬럼명 = 열 이름

In [40]:
import pandas as pd
df = pd.read_csv('data/scores.csv')
df.index = 'i'+ df.index.astype('str')

# 행번호로 행 데이터 추출하기(iloc)
- 데이터프레임.iloc[행번호]
- 데이터프레임.iloc[행번호리스트]
- 데이터프레임.iloc[행번호슬라이스]
- 음수를 사용하면 행번호를 뒤에서부터 센다.

In [41]:
df.head()

       name    kor    eng   math
i0    Aiden  100.0   90.0   95.0
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0
i4    Henry    NaN   35.0   60.0

## 시리즈 형태로 추출하기

In [42]:
# 첫번째 행 추출하기
df.iloc[0]

name    Aiden
kor     100.0
eng      90.0
math     95.0
Name: i0, dtype: object

## 데이터 프레임 형태로 추출하기

In [47]:
# 1,3,5번 행 추출하기
df.iloc[[1,3,5]]

       name    kor    eng   math
i1  Charles   90.0   80.0   75.0
i3     Evan  100.0  100.0  100.0
i5      Ian   90.0  100.0   90.0

In [48]:
# 첫번째 행 추출하기(데이터프레임)
df.iloc[[0]]

     name    kor   eng  math
i0  Aiden  100.0  90.0  95.0

## 행번호 슬라이스로 추출하기

In [62]:
# 1~3행 추출하기
a1 = df.iloc[range(1,4)]
a2 = df.iloc[1:4]
a2

       name    kor    eng   math
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0

In [68]:
# 1,3,5행 슬라이스
df.iloc[1:6:2]

       name    kor    eng   math
i1  Charles   90.0   80.0   75.0
i3     Evan  100.0  100.0  100.0
i5      Ian   90.0  100.0   90.0

In [69]:
# 1행 추출하기
df.iloc[1:2]

       name   kor   eng  math
i1  Charles  90.0  80.0  75.0

In [70]:
# 짝수 행번호의 데이터 추출하기
df.iloc[::2]

         name    kor    eng   math
i0      Aiden  100.0   90.0   95.0
i2     Danial   95.0  100.0  100.0
i4      Henry    NaN   35.0   60.0
i6      James   70.0   75.0   65.0
i8     Justin   50.0   60.0  100.0
i10       Leo   90.0   95.0   70.0
i12     Peter  100.0   95.0  100.0
i14     Chloe   95.0  100.0   95.0
i16     Ellen    NaN   60.0    NaN
i18  Jennifer   80.0   55.0   80.0
i20     Linda  100.0   90.0  100.0
i22      Rose   70.0   65.0   70.0
i24   Tiffany   90.0    NaN   90.0
i26   Viviana  100.0   80.0  100.0
i28    Winnie   70.0  100.0   70.0

In [72]:
# 홀수 행번호의 데이터 추출하기
df.iloc[1::2]

        name    kor    eng   math
i1   Charles   90.0   80.0   75.0
i3      Evan  100.0  100.0  100.0
i5       Ian   90.0  100.0   90.0
i7    Julian   80.0   90.0   55.0
i9     Kevin  100.0  100.0   90.0
i11   Oliver   70.0   75.0   65.0
i13      Amy   90.0   75.0   90.0
i15    Danna  100.0  100.0  100.0
i17     Emma   70.0   65.0   70.0
i19     Kate   50.0    NaN   50.0
i21   Olivia   90.0   70.0   90.0
i23    Sofia  100.0  100.0  100.0
i25  Vanessa   95.0   70.0   95.0
i27   Vikkie    NaN   50.0  100.0
i29     Zuly   80.0   90.0   95.0

## 음수 행번호로 추출하기

In [77]:
# 마지막행 추출하기
df.iloc[-1]

name    Zuly
kor     80.0
eng     90.0
math    95.0
Name: i29, dtype: object

In [80]:
# 마지막 2개 행 추출하기(리스트)
df.iloc[[-2,-1]]

       name   kor    eng  math
i28  Winnie  70.0  100.0  70.0
i29    Zuly  80.0   90.0  95.0

In [81]:
# 마지막 2개 행 추출하기(슬라이스)
df.iloc[-2:]

       name   kor    eng  math
i28  Winnie  70.0  100.0  70.0
i29    Zuly  80.0   90.0  95.0

# 행번호로 행,열 추출하기

## 데이터프레임.iloc[행번호,열번호]

In [88]:
df.head()

       name    kor    eng   math
i0    Aiden  100.0   90.0   95.0
i1  Charles   90.0   80.0   75.0
i2   Danial   95.0  100.0  100.0
i3     Evan  100.0  100.0  100.0
i4    Henry    NaN   35.0   60.0

In [89]:
# 0번째 행, 0번째 열
df.iloc[0,0]

'Aiden'

## 데이터프레임.iloc[행번호,열번호리스트]

In [91]:
# 0번째 행 kor, eng
df.iloc[0,[1,2]]

kor    100.0
eng     90.0
Name: i0, dtype: object

## 데이터프레임.iloc[행번호리스트,열번호]

In [92]:
# 1,3,4번째 행 kor
df.iloc[[1,3,4],1]

i1     90.0
i3    100.0
i4      NaN
Name: kor, dtype: float64

## 데이터프레임.iloc[행번호리스트,열번호리스트]

In [93]:
# 1,3,4번째 행 name, eng
df.iloc[[1,3,4],[0,2]]

       name    eng
i1  Charles   80.0
i3     Evan  100.0
i4    Henry   35.0

## 데이터프레임.iloc[행번호슬라이싱,열번호슬라이싱]

In [96]:
# 0,1번째 행 0,1번째 열 슬라이싱
df.iloc[:2,:2]

       name    kor
i0    Aiden  100.0
i1  Charles   90.0

In [97]:
# 1,3,5번째 행 0,2번째 열 슬라이싱
df.iloc[1:6:2,:2]

       name    kor
i1  Charles   90.0
i3     Evan  100.0
i5      Ian   90.0

In [98]:
df.tail()

        name    kor    eng   math
i25  Vanessa   95.0   70.0   95.0
i26  Viviana  100.0   80.0  100.0
i27   Vikkie    NaN   50.0  100.0
i28   Winnie   70.0  100.0   70.0
i29     Zuly   80.0   90.0   95.0

In [107]:
# 마지막행 1,3열 슬라이싱
df.iloc[-1,1:4:2]

kor     80.0
math    95.0
Name: i29, dtype: object

In [108]:
# 모든행, 1열
df.iloc[:,1]

i0     100.0
i1      90.0
i2      95.0
i3     100.0
i4       NaN
i5      90.0
i6      70.0
i7      80.0
i8      50.0
i9     100.0
i10     90.0
i11     70.0
i12    100.0
i13     90.0
i14     95.0
i15    100.0
i16      NaN
i17     70.0
i18     80.0
i19     50.0
i20    100.0
i21     90.0
i22     70.0
i23    100.0
i24     90.0
i25     95.0
i26    100.0
i27      NaN
i28     70.0
i29     80.0
Name: kor, dtype: float64

In [109]:
# 모든행, 1,2열
df.iloc[:,1:3]

       kor    eng
i0   100.0   90.0
i1    90.0   80.0
i2    95.0  100.0
i3   100.0  100.0
i4     NaN   35.0
i5    90.0  100.0
i6    70.0   75.0
i7    80.0   90.0
i8    50.0   60.0
i9   100.0  100.0
i10   90.0   95.0
i11   70.0   75.0
i12  100.0   95.0
i13   90.0   75.0
i14   95.0  100.0
i15  100.0  100.0
i16    NaN   60.0
i17   70.0   65.0
i18   80.0   55.0
i19   50.0    NaN
i20  100.0   90.0
i21   90.0   70.0
i22   70.0   65.0
i23  100.0  100.0
i24   90.0    NaN
i25   95.0   70.0
i26  100.0   80.0
i27    NaN   50.0
i28   70.0  100.0
i29   80.0   90.0